#+TITLE: CodeMapper: Semi-automatic coding of case definitions  
#+AUTHOR: BB, EM, MS, JO
#+EMAIL: b.becker@erasmusmc.nl
#+LANGUAGE:  en
#+OPTIONS: toc:nil H:5
#+LATEX_CLASS: koma-article
#+LATEX_HEADER: \input{mystyle.tex}
# #+LATEX_CLASS_OPTIONS: [a4paper,14pt,DIV=40]
# #+LATEX_HEADER: \addtokomafont{section}{\clearpage}
#+LATEX_HEADER: \doublespacing
**** The reference mapping
We use code sets from the SAFEGUARD[fn:safeguard] project as a
reference for the evaluation.  We selected this project for the
variety of mapped events, the range of targeted coding systems in use
in the European Union and the United States, and the manual mapping
process that included review and feedback by database custodians.

The SAFEGUARD project provides textual case definitions for nine
events.  One event was excluded from the evaluation because the code
sets of many target coding systems were missing (sudden cardiac death;
the event was captured in only two EHR databases targeted in
SAFEGUARD).  One event was excluded because the textual case
definition is comprised of only a short symptomatic description of the
event (heart failure).  Table [[tbl:reference]] shows the retained events.

The events were mapped to code sets for six EHR databases with four
coding systems: Lombardy, Medicare, Puglia, PHARMO (all ICD-9
[[cite:icd9]]), GePaRD (ICD-10 [[cite:pavillon1992ICD10]]), IPCI (ICPC-2
[[cite:hofmans1996ICPC]]), and CPRD (READ-2, [[cite:schulz1996read2]]).
Differences between codes sets for databases with the same coding
system are due to characteristics of the databases (general
practitioner's vs. primary care) requiring the inclusion of
database-specific proxies and exclusion criteria.  Because mappings
are created in CodeMapper by coding systems, we selected only one code
set for each coding system (Medicare[fn:icd9], GePaRD, CPRD[fn:read2],
IPCI).

Overall, the reference code sets contains 438 codes for seven events
and four target coding systems (see table [[tbl:reference]]).  The size of
code sets differs between coding systems: The codes sets for READ-2
contain 48.33 codes at average and the code sets for ICPC-2 contain
only 3 codes at average.  This discrepancy is firstly due to the
differences of granularity of the coding systems (READ-2 has 77290
codes in UMLS and ICPC-2 has 1397).  Secondly, the queries to the IPCI
database (to which the ICPC-2 code sets are targeted) are supported
by keyword searches on the free-text portion of the medical record.

The name and the case definitions of the remaining events were
provided as an input to CodeMapper.  Exclusion codes where not taken
into account in the evaluation because they were not specified in the
textual case definitions but added based on the database-specific
needs.

#+CAPTION: Size of reference case definition and code sets
#+NAME: tbl:reference
#+begin_table
#+begin_threeparttable
#+ATTR_LATEX: :booktabs t :font \scriptsize :center nil :align @{}lrrrrrrr@{}
|                        | Case definition | \multicolumn{4}{c}{Code sets} |
| Event                  | (word count) | ICD-9 | ICD-10 | READ-2 | ICPC-2^{a)} |
|------------------------+--------------+-------+--------+--------+----------|
| Acute Pancreatitis     |           49 |     1 |      6 |      7 |        1 |
| Bladder cancer         |           87 |    12 |     12 |     91 |        4 |
| Hemorrhagic stroke     |           48 |     5 |     24 |     36 |        3 |
| Ischemic stroke        |           53 |    10 |     11 |     20 |        3 |
| Myocardial Infarction  |           39 |    12 |      7 |    -^{b)} |        7 |
| Pancreatic Cancer      |           19 |     8 |      9 |    109 |        2 |
| Ventricular Arrhythmia |          234 |     5 |      5 |     27 |        1 |
|------------------------+--------------+-------+--------+--------+----------|
| Sum                    |          529 |    53 |     74 |    290 |       21 |
| Average                |        75.57 |  7.57 |  10.57 |  48.33 |        3 |
#+TBLFM: @10$2=vsum(@3..@9)::@11$2=round(vmean(@3..@9), 2)
#+begin_tablenotes
[flushleft]
\scriptsize
\item[a)] Additional text-based queries
\item[b)] Text-based query only
#+end_tablenotes
#+end_threeparttable
#+end_table

[fn:safeguard] \r{TODO} How to refer to SAFEGUARD? Grant agreement
HEALTH-282521

[fn:icd9] Because the code sets uses code from ICD-9 and ICD-9/CM we
integrated a target coding system in CodeMapper that is the union of
ICD-9 and ICD-9/CM.

[fn:read2] To generate READ-2 codes which are not part of the UMLS, an
additional translation table between READ version 2 and version 3 is
integrated into CodeMapper
* Appendix
:PROPERTIES:
:UNNUMBERED: t
:END:
#+CAPTION: Performance measures of the CodeMapper evaluation
#+NAME: tbl:performance
#+ATTR_LATEX: :booktabs t :font \scriptsize :align @{}llrrrrr@{}
|                  |             | READ-2 | ICD-10 | ICPC-2 | ICD-9 | Average |
|------------------+-------------+--------+--------+--------+-------+---------|
| /baseline/       | Sensitivity |  0.124 |  0.174 |  0.175 | 0.295 |   0.192 |
|                  | PPV         |  0.458 |  0.491 |  0.700 | 0.514 |   0.541 |
| /maximum-recall/ | Sensitivity |  0.930 |  0.938 |  1.000 | 0.988 |   0.964 |
|                  | PPV         |  0.861 |  0.568 |  0.924 | 0.559 |   0.728 |
| /expand_{1}/     | Sensitivity |  0.592 |  0.724 |  0.556 | 0.859 |   0.683 |
|                  | PPV         |  0.645 |  0.537 |  0.743 | 0.499 |   0.606 |
| /expand_{2}/     | Sensitivity |  0.786 |  0.829 |  0.603 | 0.888 |   0.777 |
|                  | PPV         |  0.545 |  0.478 |  0.707 | 0.425 |   0.539 |
| /expand_{3}/     | Sensitivity |  0.849 |  0.876 |  0.603 | 0.902 |   0.808 |
|                  | PPV         |  0.527 |  0.476 |  0.707 | 0.428 |   0.535 |
#+TBLFM: $7=round(vmean($3..$6), 3)
